In [29]:
import pandas as pd
from sqlalchemy import create_engine, text

In [30]:
#creacion de conexion a la base de datos
engine = create_engine('sqlite:///:memory:')

In [31]:
#creacion de data frame
data = {
    'Empleado': ['Juan','Ana','Pedro','Luis','Maria'],
    'Departamento': ['Ventas','Marketing','Ventas','IT','Marketing'],
    'Salario': [55000,60000,55000,58000,62000],
    'Experiencia': [5,7,6,8,9]
}

df = pd.DataFrame(data)
display(df)

  Empleado Departamento  Salario  Experiencia
0     Juan       Ventas    55000            5
1      Ana    Marketing    60000            7
2    Pedro       Ventas    55000            6
3     Luis           IT    58000            8
4    Maria    Marketing    62000            9

In [32]:
#guardar a en la base de datos
df.to_sql('empleados', engine, index=False, if_exists='replace')

5

In [33]:
#leer de la base de datos
df_leido = pd.read_sql('empleados', engine)
display(df_leido)

  Empleado Departamento  Salario  Experiencia
0     Juan       Ventas    55000            5
1      Ana    Marketing    60000            7
2    Pedro       Ventas    55000            6
3     Luis           IT    58000            8
4    Maria    Marketing    62000            9

In [34]:
#consulta de sql y que se convierta en un data frame
consulta_sql = "SELECT Empleado, Salario FROM empleados WHERE Salario = 55000"
df_consulta = pd.read_sql(consulta_sql, engine)
display(df_consulta)

  Empleado  Salario
0     Juan    55000
1    Pedro    55000

In [39]:
#actualizar y eliminar datos de la base de datos
with engine.connect() as con:
    con.execute(text("UPDATE empleados SET Salario = Salario * 1.1 WHERE Departamento = 'Ventas'"))

In [40]:
df_actualizado = pd.read_sql('empleados', engine)
display(df_actualizado)

  Empleado Departamento  Salario  Experiencia
0     Juan       Ventas    55000            5
1      Ana    Marketing    60000            7
2    Pedro       Ventas    55000            6
3     Luis           IT    58000            8
4    Maria    Marketing    62000            9

In [41]:
#eliminar datos
with engine.connect() as con:
    con.execute(text("DELETE FROM empleados WHERE Empleado = 'Pedro'"))

In [42]:
df_eliminado = pd.read_sql('empleados', engine)
display(df_eliminado)

  Empleado Departamento  Salario  Experiencia
0     Juan       Ventas    55000            5
1      Ana    Marketing    60000            7
2    Pedro       Ventas    55000            6
3     Luis           IT    58000            8
4    Maria    Marketing    62000            9